#/bin/bash

#-----------------------------------------------------------------------
# パラメータ
#-----------------------------------------------------------------------
# 扱うファイルリスト
files=""

# 対応する拡張子のリスト
extensions="c cpp"

#-----------------------------------------------------------------------
# 引数チェック
#-----------------------------------------------------------------------
if [ $# = 0 ]; then
    echo "Error! No input files."
    exit
fi

#-----------------------------------------------------------------------
# 入力されたファイル名をチェック
#-----------------------------------------------------------------------
for file in $*; do
    basename=${file##*/}	# 拡張子を含めたベースネーム
    extension=${basename##*\.}	# 拡張子

    # 拡張子を確認する
    if [ $extension == $basename ]; then
	# 拡張子とベースネームが同じ -> 拡張子なしとする
	for ext in $extensions; do
	    # 指定の拡張子を持つファイル名を検索して追加する
	    if [ -e ${file}.${ext} ]; then
		files="$files ${file}.${ext}"
	    fi
	done
    else
	# 拡張子あり
	files="$files ${file}"
    fi
done

#-----------------------------------------------------------------------
# 各ファイルをコンパイル
#-----------------------------------------------------------------------
for file in $files; do
    cc="cc"
    basename=${file##*/}	# 拡張子を含めたベースネーム
    extension=${basename##*\.}	# 拡張子
    progname=${file%.*}		# 実行プログラムネーム
    libs=-lncurses

    case $extension in
	"c")	cc="gcc";;
	"cpp")	cc="g++";;
    esac

    echo "$cc $file -o $progname"
    $cc $file -o $progname $libs
done

#-----------------------------------------------------------------------
# EOF
#-----------------------------------------------------------------------
